#include <stdio.h>

#include <conio.h>

int main()

{

float x, y; //оголошення змінних

float *x_ptr,*y_ptr; // оголошення полкажчиків

x_ptr=&x; // присвоєння покажчику адреси змінної х

*x_ptr=5; // присвоєння покажчику та через цей покажчик змінній х значення 5

x=5.5 + *x_ptr; // х = 10.5, бо до 5.5 додаємо покажчик який має значення 5

y_ptr=x_ptr; // присвоюємо вказівнику y_ptr те саме значення, що і x_ptr, тобто тепер y_ptr також вказує на змінну x.

y= *y_ptr/2+ *x_ptr ; // так як покажчик y_ptr вказує на змінну х (яка дорівнює 10.5) та покажчик x_ptr = х = 10.5
//(звернем те що не має дужок, то знаменник буде тільки 2) то (10.5/2) + 10.5 = 5.25 + 10.5 = 15.75, отже у = 15.5

y_ptr=&y; // покажчику y_ptr присвоємо адресу на змінну у


printf("The value of x= %f y=%f\n", x, y); // виводимо значення змінних x та y.

printf("The address of x = %p y = %p\n", &x, &y); // виводимо адреси комірок в пам'яті змінних x та y.

printf("The value of x_ptr = %p y_ptr = %p\n", x_ptr, y_ptr); // виводимо значення вказівників.
// x_ptr зараз зберігає адресу змінної x, а y_ptr (після зміни) містить адресу змінної y.

printf("The value that x_ptr points to is %f .\n", *x_ptr); // виводимо значення, на яке вказує x_ptr (тобто значення x).

printf("The value that y_ptr points to is %f.\n", *y_ptr); // виводимо значення, на яке вказує y_ptr (тобто значення y).

printf("The address of x_ptr is %p.\n", &x_ptr); // виводимо адресу самого вказівника x_ptr (розташування пам'яті, де зберігається адреса x).

printf("The address of y_ptr is %p.\n", &y_ptr); // виводимо адресу самого вказівника y_ptr (розташування пам'яті, де зберігається адреса y).

puts("====================================================");

getch();



}